In [1]:
import pandas as pd
list={"city":["pune","nagar","mumbai","hydrabad"],"temperature":[44,55,23,60]}
data=pd.DataFrame(list)
print(data)

       city  temperature
0      pune           44
1     nagar           55
2    mumbai           23
3  hydrabad           60

In [4]:
data.shape

(4, 2)

In [5]:
data.head

<bound method NDFrame.head of        city  temperature
0      pune           44
1     nagar           55
2    mumbai           23
3  hydrabad           60>

In [6]:
data.tail

<bound method NDFrame.tail of        city  temperature
0      pune           44
1     nagar           55
2    mumbai           23
3  hydrabad           60>

In [7]:
data.tail(2)

       city  temperature
2    mumbai           23
3  hydrabad           60

In [8]:
data.head(2)

    city  temperature
0   pune           44
1  nagar           55

In [61]:
dt=pd.read_csv("https://www.stats.govt.nz/assets/Uploads/Annual-enterprise-survey/Annual-enterprise-survey-2020-financial-year-provisional/Download-data/annual-enterprise-survey-2020-financial-year-provisional-csv.csv")

In [62]:
dt

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2020,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"733,258",ANZSIC06 divisions A-S (excluding classes K633...
1,2020,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"660,630",ANZSIC06 divisions A-S (excluding classes K633...
2,2020,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"54,342",ANZSIC06 divisions A-S (excluding classes K633...
3,2020,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"18,285",ANZSIC06 divisions A-S (excluding classes K633...
4,2020,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,872",ANZSIC06 divisions A-S (excluding classes K633...
...,...,...,...,...,...,...,...,...,...,...
37075,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
37076,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
37077,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
37078,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
37079,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

In [12]:
dt.shape

(37080, 10)

In [59]:
list={"city":["pune","nagar","mumbai","hydrabad","nashik","tane","kolkata","delhi"],"temperature":[44,55,23,60,55,63,25,28],
     "population":[1222222,55555555,88888888,666666666,555777777,2333333333,777777777,3333333333333]}
df=pd.DataFrame(list)
print(df)

       city  temperature     population
0      pune           44        1222222
1     nagar           55       55555555
2    mumbai           23       88888888
3  hydrabad           60      666666666
4    nashik           55      555777777
5      tane           63     2333333333
6   kolkata           25      777777777
7     delhi           28  3333333333333

In [60]:
df.iloc[[2]]

     city  temperature  population
2  mumbai           23    88888888

In [25]:
df[["city","population"]]

       city     population
0      pune        1222222
1     nagar       55555555
2    mumbai       88888888
3  hydrabad      666666666
4    nashik      555777777
5      tane     2333333333
6   kolkata      777777777
7     delhi  3333333333333

In [33]:
result=pd.merge(data,df,on="city",how="outer", indicator="true")
print(result)

       city  temperature_x  temperature_y     population        true
0      pune           44.0             44        1222222        both
1     nagar           55.0             55       55555555        both
2    mumbai           23.0             23       88888888        both
3  hydrabad           60.0             60      666666666        both
4    nashik            NaN             55      555777777  right_only
5      tane            NaN             63     2333333333  right_only
6   kolkata            NaN             25      777777777  right_only
7     delhi            NaN             28  3333333333333  right_only

In [44]:
df.sort_values("population")

       city  temperature     population
0      pune           44        1222222
1     nagar           55       55555555
2    mumbai           23       88888888
4    nashik           55      555777777
3  hydrabad           60      666666666
6   kolkata           25      777777777
5      tane           63     2333333333
7     delhi           28  3333333333333

In [48]:
df.sort_values("population",ascending=False)

       city  temperature     population
7     delhi           28  3333333333333
5      tane           63     2333333333
6   kolkata           25      777777777
3  hydrabad           60      666666666
4    nashik           55      555777777
2    mumbai           23       88888888
1     nagar           55       55555555
0      pune           44        1222222

In [71]:
dt1=dt[["Year","Variable_name","Value"]].head(10)
print(dt1)

   Year                                    Variable_name    Value
0  2020                                     Total income  733,258
1  2020  Sales, government funding, grants and subsidies  660,630
2  2020                Interest, dividends and donations   54,342
3  2020                             Non-operating income   18,285
4  2020                                Total expenditure  654,872
5  2020                           Interest and donations   32,730
6  2020                                   Indirect taxes    7,509
7  2020                                     Depreciation   26,821
8  2020                          Salaries and wages paid  119,387
9  2020                         Redundancy and severance      305

In [66]:
dt2=dt[["Year","Variable_category"]].head(10)
print(dt2)

   Year      Variable_category
0  2020  Financial performance
1  2020  Financial performance
2  2020  Financial performance
3  2020  Financial performance
4  2020  Financial performance
5  2020  Financial performance
6  2020  Financial performance
7  2020  Financial performance
8  2020  Financial performance
9  2020  Financial performance

In [72]:
add=pd.merge(dt1,dt2,on="Year",indicator=True).head(10)
print(add)

   Year Variable_name    Value      Variable_category _merge
0  2020  Total income  733,258  Financial performance   both
1  2020  Total income  733,258  Financial performance   both
2  2020  Total income  733,258  Financial performance   both
3  2020  Total income  733,258  Financial performance   both
4  2020  Total income  733,258  Financial performance   both
5  2020  Total income  733,258  Financial performance   both
6  2020  Total income  733,258  Financial performance   both
7  2020  Total income  733,258  Financial performance   both
8  2020  Total income  733,258  Financial performance   both
9  2020  Total income  733,258  Financial performance   both

In [74]:
add.sort_values("Value",ascending=False)

   Year Variable_name    Value      Variable_category _merge
0  2020  Total income  733,258  Financial performance   both
1  2020  Total income  733,258  Financial performance   both
2  2020  Total income  733,258  Financial performance   both
3  2020  Total income  733,258  Financial performance   both
4  2020  Total income  733,258  Financial performance   both
5  2020  Total income  733,258  Financial performance   both
6  2020  Total income  733,258  Financial performance   both
7  2020  Total income  733,258  Financial performance   both
8  2020  Total income  733,258  Financial performance   both
9  2020  Total income  733,258  Financial performance   both